rotationalgalloping/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (-15    -15    -0.5)  // 0
    (-6     -15    -0.5)  // 1
    (-4     -15    -0.5)  // 2
    ( 4     -15    -0.5)  // 3
    ( 6     -15    -0.5)  // 4
    ( 25    -15    -0.5)  // 5
    (-15     -4    -0.5)  // 6
    (-4      -2    -0.5)  // 7
    (-2      -2    -0.5)  // 8
    ( 2      -2    -0.5)  // 9
    ( 4      -2    -0.5)  //10
    ( 25     -6    -0.5)  //11
    (-15     -2    -0.5)  //12
    (-4      -0.5  -0.5)  //13
    (-2.0    -0.5  -0.5)  //14
    ( 2.0    -0.5  -0.5)  //15
    ( 4      -0.5  -0.5)  //16
    ( 25     -2.5  -0.5)  //17
    (-15      2    -0.5)  //18
    (-4       0.5  -0.5)  //19
    (-2.0     0.5  -0.5)  //20
    ( 2.0     0.5  -0.5)  //21
    ( 4       0.5  -0.5)  //22
    ( 25      2.5  -0.5)  //23
    (-15      4    -0.5)  //24
    (-4       2    -0.5)  //25
    (-2       2    -0.5)  //26
    ( 2       2    -0.5)  //27
    ( 4       2    -0.5)  //28
    ( 25      6    -0.5)  //29
    (-15     15    -0.5)  //30
    ( -6     15    -0.5)  //31
    ( -4     15    -0.5)  //32
    (  4     15    -0.5)  //33
    (  6     15    -0.5)  //34
    ( 25     15    -0.5)  //35

    (-15    -15     0.5)  // 0
    (-6     -15     0.5)  // 1
    (-4     -15     0.5)  // 2
    ( 4     -15     0.5)  // 3
    ( 6     -15     0.5)  // 4
    ( 25    -15     0.5)  // 5
    (-15     -4     0.5)  // 6
    (-4      -2     0.5)  // 7
    (-2      -2     0.5)  // 8
    ( 2      -2     0.5)  // 9
    ( 4      -2     0.5)  //10
    ( 25     -6     0.5)  //11
    (-15     -2     0.5)  //12
    (-4      -0.5   0.5)  //13
    (-2.0    -0.5   0.5)  //14
    ( 2.0    -0.5   0.5)  //15
    ( 4      -0.5   0.5)  //16
    ( 25     -2.5   0.5)  //17
    (-15      2     0.5)  //18
    (-4       0.5   0.5)  //19
    (-2.0     0.5   0.5)  //20
    ( 2.0     0.5   0.5)  //21
    ( 4       0.5   0.5)  //22
    ( 25      2.5   0.5)  //23
    (-15      4     0.5)  //24
    (-4       2     0.5)  //25
    (-2       2     0.5)  //26
    ( 2       2     0.5)  //27
    ( 4       2     0.5)  //28
    ( 25      6     0.5)  //29
    (-15     15     0.5)  //30
    ( -6     15     0.5)  //31
    ( -4     15     0.5)  //32
    (  4     15     0.5)  //33
    (  6     15     0.5)  //34
    ( 25     15     0.5)  //35
);

blocks
(
    hex (0   1   7   6   36   37   43   42) ( 30 30 1) simpleGrading (2 0.2 1)
    hex (1   2   8   7   37   38   44   43) ( 20 30 1) simpleGrading (0.5 0.2 1)
    hex (2   3   9   8   38   39   45   44) ( 50 30 1) simpleGrading (1 0.2 1)
    hex (3   4  10   9   39   40   46   45) ( 20 30 1) simpleGrading (2 0.2 1)
    hex (4   5  11  10   40   41   47   46) ( 50 30 1) simpleGrading (5 0.2 1)

    hex (6   7  13  12  42  43  49  48) ( 30 20 1) simpleGrading (2 1 1)
    hex (7   8  14  13  43  44  50  49) ( 20 20 1) simpleGrading (0.5 1 1)
    hex (8   9  15  14  44  45  51  50) ( 50 20 1) simpleGrading (1 1 1)
    hex (9  10  16  15  45  46  52  51) ( 20 20 1) simpleGrading (2 1 1)
    hex (10 11  17  16  46  47  53  52) ( 50 20 1) simpleGrading (5 1 1)

    hex (12	13	19	18	48	49	55	54) ( 30 20 1) simpleGrading (2 1 1)
    hex (13	14	20	19	49	50	56	55) ( 20 20 1) simpleGrading (0.5 1 1)
    hex (15	16	22	21	51	52	58	57) ( 20 20 1) simpleGrading (2 1 1)
    hex (16	17	23	22	52	53	59	58) ( 50 20 1) simpleGrading (5 1 1)

    hex (18	19	25	24	54	55	61	60) ( 30 20 1) simpleGrading (2 1 1)
    hex (19	20	26	25	55	56	62	61) ( 20 20 1) simpleGrading (0.5 1 1)
    hex (20	21	27	26	56	57	63	62) ( 50 20 1) simpleGrading (1 1 1)
    hex (21	22	28	27	57	58	64	63) ( 20 20 1) simpleGrading (2 1 1)
    hex (22	23	29	28	58	59	65	64) ( 50 20 1) simpleGrading (5 1 1)

    hex (24	25	31	30	60	61	67	66) ( 30 30 1) simpleGrading (2 5 1)
    hex (25	26	32	31	61	62	68	67) ( 20 30 1) simpleGrading (0.5 5 1)
    hex (26	27	33	32	62	63	69	68) ( 50 30 1) simpleGrading (1 5 1)
    hex (27	28	34	33	63	64	70	69) ( 20 30 1) simpleGrading (2 5 1)
    hex (28	29	35	34	64	65	71	70) ( 50 30 1) simpleGrading (5 5 1)


);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 0  6 36 42)
            ( 6 12 42 48)
            (12 18 48 54)
            (18 24 54 60)
            (24 30 60 66)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            ( 5  11  41  47)
            (11  17  47  53)
            (17  23  53  59)
            (23  29  59  65)
            (29  35  65  71)
        );
    }

    cylinder
    {
        type wall;
        faces
        (
            (14 15 50 51)
            (15 21 51 57)
            (21 20 57 56)
            (20 14 56 50)
        );
    }

    top
    {
        type slip;
        faces
        (
            (30  31  66  67)
            (31  32  67  68)
            (32  33  68  69)
            (33  34  69  70)
            (34  35  70  71)
        );
    }

    bottom
    {
        type slip;
        faces
        (
            (0   1   36   37)
            (1   2   37   38)
            (2   3   38   39)
            (3   4   39   40)
            (4   5   40   41)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (  0    1    7    6 )
            (  1    2    8    7 )
            (  2    3    9    8 )
            (  3    4   10    9 )
            (  4    5   11   10 )
            (  6    7   13   12 )
            (  7    8   14   13 )
            (  8    9   15   14 )
            (  9   10   16   15 )
            ( 10   11   17   16 )
            ( 12   13   19   18 )
            ( 13   14   20   19 )
            ( 15   16   22   21 )
            ( 16   17   23   22 )
            ( 18   19   25   24 )
            ( 19   20   26   25 )
            ( 20   21   27   26 )
            ( 21   22   28   27 )
            ( 22   23   29   28 )
            ( 24   25   31   30 )
            ( 25   26   32   31 )
            ( 26   27   33   32 )
            ( 27   28   34   33 )
            ( 28   29   35   34 )

            ( 36   37   43   42 )
            ( 37   38   44   43 )
            ( 38   39   45   44 )
            ( 39   40   46   45 )
            ( 40   41   47   46 )
            ( 42   43   49   48 )
            ( 43   44   50   49 )
            ( 44   45   51   50 )
            ( 45   46   52   51 )
            ( 46   47   53   52 )
            ( 48   49   55   54 )
            ( 49   50   56   55 )
            ( 51   52   58   57 )
            ( 52   53   59   58 )
            ( 54   55   61   60 )
            ( 55   56   62   61 )
            ( 56   57   63   62 )
            ( 57   58   64   63 )
            ( 58   59   65   64 )
            ( 60   61   67   66 )
            ( 61   62   68   67 )
            ( 62   63   69   68 )
            ( 63   64   70   69 )
            ( 64   65   71   70 )
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
