rotationalgalloping/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       38440;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       38560;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          140;
        startFace       38680;
    }
    top
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          170;
        startFace       38820;
    }
    bottom
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          170;
        startFace       38990;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          38800;
        startFace       39160;
    }
)

// ************************************************************************* //
